package java16;

public class 정리 {
	/* 변수 : 하나의 데이터의 하나의 이름
	 * 하나의 변수명은 반드시 타입을 앞에다 지정
	 * 여러개의 데이터가 여러개의 이름
	 * 여러개의 변수명에 타입을 모두지정
	 * 
	 *  배열 : 하나의 이름을 여러개의 데이터를 사용
	 *  타입 지정도 한번만!
	 *  크기가 고정, 같은 타입의 데이터만 묶을 수 있다.
	 *  
	 *  컬렉션 : 하나의 이름으로 여러개의 데이터를 사용
	 *  타입 지정도 한번만!
	 *  크기가 유동적, 다른 타입의 데이터도 묶을 수 있다.
	 *  클래스(DTO)를 묶을 때 보통 사용
	 *  Vector
	 * 
	 * 컬렉션의 데이터 형태에 따른 분류
	 * -------------------------------
	 * List 타입 : 순서o, 순위, ArrayList
	 * Set 타입 : 중복허용x, HashSet
	 * Queue 타입 : FIFO
	 * Map 타입 : 키 + 값, HashMap
	 * 
	 * */
}
